Luos-io/luos_engine/network/robus_network/HAL/STM32F4/robus_hal.c
    // Transmission management
    if ((LL_USART_IsActiveFlag_TC(ROBUS_COM) != RESET) && (LL_USART_IsEnabledIT_TC(ROBUS_COM) != RESET))
    {
        // Transmission complete
        data_size_to_transmit = 0;
        // Switch to reception mode
        RobusHAL_SetTxState(false);
        RobusHAL_SetRxState(true);
        // Disable transmission complete IRQ
        LL_USART_ClearFlag_TC(ROBUS_COM);
        LL_USART_DisableIT_TC(ROBUS_COM);
    }
#ifdef USE_TX_IT
    else if ((LL_USART_IsActiveFlag_TXE(ROBUS_COM) != RESET) && (LL_USART_IsEnabledIT_TXE(ROBUS_COM) != RESET))
    {
        // Transmit buffer empty (this is a software DMA)
        data_size_to_transmit--;
        LL_USART_TransmitData8(ROBUS_COM, *(tx_data++));
        if (data_size_to_transmit == 0)
        {
            // Transmission complete, stop loading data and watch for the end of transmission
            // Disable Transmission empty buffer interrupt
            LL_USART_DisableIT_TXE(ROBUS_COM);
            // Enable Transmission complete interrupt
            LL_USART_EnableIT_TC(ROBUS_COM);
        }
    }
#endif
    ROBUS_COM->SR = 0xFFFFFFFF;
}
/******************************************************************************
 * @brief Process data transmit
 * @param None
 * @return None
 ******************************************************************************/
_CRITICAL void RobusHAL_ComTransmit(uint8_t *data, uint16_t size)
{
    while (LL_USART_IsActiveFlag_TXE(ROBUS_COM) == RESET)
        ;
    // Disable RX detec pin if needed

    // Reduce size by one because we send one directly
    data_size_to_transmit = size - 1;
    if (size > 1)
    {
        // Start the data buffer transmission
        // **** NO DMA
        // Copy the data pointer globally alowing to keep it and run the transmission.
        tx_data = data;
#ifdef USE_TX_IT
        // Send the first byte
        LL_USART_TransmitData8(ROBUS_COM, *(tx_data++));
        // Enable Transmission empty buffer interrupt to transmit next datas
        LL_USART_EnableIT_TXE(ROBUS_COM);
        // Disable Transmission complete interrupt
        LL_USART_DisableIT_TC(ROBUS_COM);
#else
        data_size_to_transmit = 0; // to not check IT TC during collision
        // Disable DMA to load new length to be tranmitted
        LL_DMA_DisableStream(ROBUS_DMA, ROBUS_DMA_STREAM);
        // Configure address to be transmitted by DMA
        LL_DMA_SetMemoryAddress(ROBUS_DMA, ROBUS_DMA_STREAM, (uint32_t)data);
        // Set length to be tranmitted
        LL_DMA_SetDataLength(ROBUS_DMA, ROBUS_DMA_STREAM, size);
        // Set request DMA
        LL_USART_EnableDMAReq_TX(ROBUS_COM);
        // clear flag shity way must be change
        ROBUS_DMA->HIFCR = 0xFFFFFFFF;
        ROBUS_DMA->LIFCR = 0xFFFFFFFF;
        // Enable TX
        RobusHAL_SetTxState(true);
        // Enable DMA again
        LL_DMA_EnableStream(ROBUS_DMA, ROBUS_DMA_STREAM);
        // Enable transmit complete
        LL_USART_EnableIT_TC(ROBUS_COM);
#endif
    }
    else
    {
        // Wait before send ack
        data_size_to_transmit = 1;
        // This is a patch du to difference MCU frequency
        while (LL_TIM_GetCounter(ROBUS_TIMER) < TIMEOUT_ACK)
            ;
        // Enable TX
        RobusHAL_SetTxState(true);
        // Transmit the only byte we have
        LL_USART_TransmitData8(ROBUS_COM, *data);
        // Enable Transmission complete interrupt because we only have one.
        LL_USART_EnableIT_TC(ROBUS_COM);
    }
    RobusHAL_ResetTimeout(DEFAULT_TIMEOUT);
}
/******************************************************************************
 * @brief set state of Txlock detection pin
 * @param None
 * @return Lock status
 ******************************************************************************/
_CRITICAL void RobusHAL_SetRxDetecPin(uint8_t Enable)
{
    if (TX_LOCK_DETECT_IRQ != DISABLE)
    {
        __HAL_GPIO_EXTI_CLEAR_IT(TX_LOCK_DETECT_IRQ);
        if (Enable == true)
        {
            EXTI->IMR |= TX_LOCK_DETECT_PIN;
        }
        else
        {
            EXTI->IMR &= ~TX_LOCK_DETECT_PIN;
        }
    }
}
/******************************************************************************
 * @brief get Lock Com transmit status this is the HW that can generate lock TX
 * @param None
 * @return Lock status
 ******************************************************************************/
_CRITICAL uint8_t RobusHAL_GetTxLockState(void)
{
    uint8_t result = false;

#ifdef USART_ISR_BUSY
    if (LL_USART_IsActiveFlag_BUSY(ROBUS_COM) == true)
    {
        RobusHAL_ResetTimeout(DEFAULT_TIMEOUT);
        result = true;
    }
#else
    if ((TX_LOCK_DETECT_PIN != DISABLE) && (TX_LOCK_DETECT_PORT != DISABLE))
    {
        if (HAL_GPIO_ReadPin(TX_LOCK_DETECT_PORT, TX_LOCK_DETECT_PIN) == GPIO_PIN_RESET)
        {
            result = true;
        }
        if (TX_LOCK_DETECT_IRQ == DISABLE)
        {
            if (result == true)
            {
                RobusHAL_ResetTimeout(DEFAULT_TIMEOUT);
            }
        }
    }
#endif
    return result;
}
/******************************************************************************
 * @brief Luos Timeout initialisation
 * @param None
 * @return None
 ******************************************************************************/
static void RobusHAL_TimeoutInit(void)
{
    LL_TIM_InitTypeDef TimerInit = {0};

    // initialize clock
    ROBUS_TIMER_CLOCK_ENABLE();

    TimerInit.Autoreload        = DEFAULT_TIMEOUT;
    TimerInit.ClockDivision     = LL_TIM_CLOCKDIVISION_DIV1;
    TimerInit.CounterMode       = LL_TIM_COUNTERMODE_UP;
    TimerInit.Prescaler         = Timer_Prescaler - 1;
    TimerInit.RepetitionCounter = 0;
    while (LL_TIM_Init(ROBUS_TIMER, &TimerInit) != SUCCESS)
        ;
    LL_TIM_EnableIT_UPDATE(ROBUS_TIMER);
    HAL_NVIC_SetPriority(ROBUS_TIMER_IRQ, 0, 2);
    HAL_NVIC_EnableIRQ(ROBUS_TIMER_IRQ);
}
/******************************************************************************
 * @brief Luos Timeout for Rx communication
 * @param None
 * @return None
 ******************************************************************************/
_CRITICAL void RobusHAL_ResetTimeout(uint16_t nbrbit)
{
    /* TODO: optimize further by getting rid of the need to reach for the ARR value.
            The same result can be achieved by only setting the start value of the counter and letting it count down toward 0.
            An IRQ can then be generated when reaching 0. This way diff = counter_value.
    */

    uint32_t arr_val, diff;
    arr_val = LL_TIM_ReadReg(ROBUS_TIMER, ARR);           // Get actual timeout value
    diff    = arr_val - LL_TIM_ReadReg(ROBUS_TIMER, CNT); // Compute remaining time before timeout

    if (diff < DEFAULT_TIMEOUT)
    {
        LL_TIM_DisableCounter(ROBUS_TIMER);
        NVIC_ClearPendingIRQ(ROBUS_TIMER_IRQ); // Clear IT pending NVIC
        LL_TIM_ClearFlag_UPDATE(ROBUS_TIMER);

        LL_TIM_SetAutoReload(ROBUS_TIMER, DEFAULT_TIMEOUT);
        LL_TIM_SetCounter(ROBUS_TIMER, 0);
    }
    if (nbrbit != 0 && nbrbit != DEFAULT_TIMEOUT)
    {
        LL_TIM_SetAutoReload(ROBUS_TIMER, nbrbit); // reload value
        LL_TIM_SetCounter(ROBUS_TIMER, 0);         // Reset counter
    }
    if (nbrbit != 0)
    {
        LL_TIM_EnableCounter(ROBUS_TIMER);
    }
}
/******************************************************************************
 * @brief Luos communication Timeout
 * @param None
 * @return None
 ******************************************************************************/
_CRITICAL void ROBUS_TIMER_IRQHANDLER()
{
    if (LL_TIM_IsActiveFlag_UPDATE(ROBUS_TIMER) != RESET)
    {
        LL_TIM_ClearFlag_UPDATE(ROBUS_TIMER);
        LL_TIM_DisableCounter(ROBUS_TIMER);
        if ((ctx.tx.lock == true) && (RobusHAL_GetTxLockState() == false))
        {
            // Enable RX detection pin if needed
            RobusHAL_SetTxState(false);
            RobusHAL_SetRxState(true);
            Recep_Timeout();
        }
    }
}

